<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Јазични линии за автентикација
    |--------------------------------------------------------------------------
    |
    | Следните јазични линии се користат за време на автентикација за различни
    | пораки кои треба да ги прикажеме на корисникот. Слободни сте да ги модифицирате
    | овие јазични линии во согласност со потребите на вашата апликација.
    |
    */

    'failed' => 'Овие акредитиви не се совпаѓаат со нашите записи.',
    'throttle' => 'Премногу обиди за најава. Ве молиме обидете се повторно за :seconds секунди.',
];
