<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Линии за потсетување на лозинка
    |--------------------------------------------------------------------------
    |
    | Следниве линии се стандардни пораки кои се користат кога обидот за ажурирање
    | на лозинка не успее, како на пример за невалиден токен или невалидна нова лозинка.
    |
    */

    'password' => 'Лозинките мора да бидат најмалку шест карактери и да се совпаѓаат со потврдата.',
    'user' => 'Не можеме да најдеме корисник со таа е-пошта.',
    'token' => 'Овој токен за ресетирање на лозинката е невалиден.',
    'sent' => 'Ви испративме е-пошта со врска за ресетирање на вашата лозинка!',
    'reset' => 'Вашата лозинка е ресетирана!',

];
