<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Јазични линии за валидација
    |--------------------------------------------------------------------------
    |
    | Следните јазични линии содржат стандардни пораки за грешки кои се користат од
    | класата за валидатор. Некои од овие правила имаат повеќе верзии,
    | како на пример правилата за големина. Слободно прилагодете ги овие пораки.
    |
    */

    'accepted' => ':attribute мора да биде прифатен.',
    'active_url' => ':attribute не е валиден URL.',
    'after' => ':attribute мора да биде датум после :date.',
    'alpha' => ':attribute може да содржи само букви.',
    'alpha_dash' => ':attribute може да содржи само букви, броеви и цртички.',
    'alpha_num' => ':attribute може да содржи само букви и броеви.',
    'array' => ':attribute мора да биде низа.',
    'before' => ':attribute мора да биде датум пред :date.',
    'between' => [
        'numeric' => ':attribute мора да биде помеѓу :min и :max.',
        'file' => ':attribute мора да биде помеѓу :min и :max килобајти.',
        'string' => ':attribute мора да биде помеѓу :min и :max карактери.',
        'array' => ':attribute мора да има помеѓу :min и :max елементи.',
    ],
    'boolean' => ':attribute полето мора да биде вистина или невистина.',
    'confirmed' => ':attribute потврдата не се совпаѓа.',
    'date' => ':attribute не е валиден датум.',
    'date_format' => ':attribute не се совпаѓа со форматот :format.',
    'different' => ':attribute и :other мора да бидат различни.',
    'digits' => ':attribute мора да биде :digits цифри.',
    'digits_between' => ':attribute мора да биде помеѓу :min и :max цифри.',
    'email' => ':attribute мора да биде валидна е-пошта.',
    'filled' => ':attribute полето е задолжително.',
    'exists' => 'Избраниот :attribute е невалиден.',
    'image' => ':attribute мора да биде слика.',
    'in' => 'Избраниот :attribute е невалиден.',
    'integer' => ':attribute мора да биде цел број.',
    'ip' => ':attribute мора да биде валидна IP адреса.',
    'max' => [
        'numeric' => ':attribute не смее да биде поголем од :max.',
        'file' => ':attribute не смее да биде поголем од :max килобајти.',
        'string' => ':attribute не смее да биде поголем од :max карактери.',
        'array' => ':attribute не смее да има повеќе од :max елементи.',
    ],
    'mimes' => ':attribute мора да биде датотека од тип: :values.',
    'min' => [
        'numeric' => ':attribute мора да биде најмалку :min.',
        'file' => ':attribute мора да биде најмалку :min килобајти.',
        'string' => ':attribute мора да биде најмалку :min карактери.',
        'array' => ':attribute мора да има најмалку :min елементи.',
    ],
    'not_in' => 'Избраниот :attribute е невалиден.',
    'numeric' => ':attribute мора да биде број.',
    'regex' => 'Форматот на :attribute е невалиден.',
    'required' => ':attribute полето е задолжително.',
    'required_if' => ':attribute полето е задолжително кога :other е :value.',
    'required_with' => ':attribute полето е задолжително кога :values е присутно.',
    'required_with_all' => ':attribute полето е задолжително кога :values се присутни.',
    'required_without' => ':attribute полето е задолжително кога :values не е присутно.',
    'required_without_all' => ':attribute полето е задолжително кога ниту еден од :values не се присутни.',
    'same' => ':attribute и :other мора да се совпаѓаат.',
    'size' => [
        'numeric' => ':attribute мора да биде :size.',
        'file' => ':attribute мора да биде :size килобајти.',
        'string' => ':attribute мора да биде :size карактери.',
        'array' => ':attribute мора да содржи :size елементи.',
    ],
    'timezone' => ':attribute мора да биде валидна зона.',
    'unique' => ':attribute веќе е земен.',
    'url' => 'Форматот на :attribute е невалиден.',
    'casys' => 'Сите полиња за casys не се присутни',


    /*
    |--------------------------------------------------------------------------
    | Прилагодени јазични линии за валидација
    |--------------------------------------------------------------------------
    |
    | Овде може да наведете прилагодени пораки за валидација за атрибути користејќи го
    | конвенцијата "attribute.rule" за именување на линиите. Ова овозможува брзо
    | наведување на специфична прилагодена порака за дадено правило на атрибут.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'прилагодена-порака',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Прилагодени атрибути за валидација
    |--------------------------------------------------------------------------
    |
    | Следните јазични линии се користат за замена на место-држачите на атрибути
    | со нешто што е попријателско за читање, како на пример "E-Mail Address"
    | наместо "email". Ова едноставно ни помага да направиме пораките малку почисти.
    |
    */

    'attributes' => [],

];
